driver-tests/smtpbc/SMTPBCTests/SMTPInboundEJBJbi2/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://xml.netbeans.org/schema/newXMLSchema">
  <soapenv:Body>
    <new:Address>
      <new:name>My Name</new:name>
      <new:street>My Street</new:street>
    </new:Address>
  </soapenv:Body>
</soapenv:Envelope>