driver-tests/smtpbc/SMTPBCTests/SMTPInboundEJBJbi2/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <Address xmlns="http://xml.netbeans.org/schema/newXMLSchema">
      <ns0:name xmlns:ns0="http://xml.netbeans.org/schema/newXMLSchema">Email Sent</ns0:name>
      <ns0:street xmlns:ns0="http://xml.netbeans.org/schema/newXMLSchema">Email Sent</ns0:street>
    </Address>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
